In [1]:
import pandas as pd
import datetime as dt
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
ratings = pd.read_csv('C:/Users/DELL/Downloads/ml-latest-small/ml-latest-small/ratings.csv')
movies = pd.read_csv('C:/Users/DELL/Downloads/ml-latest-small/ml-latest-small/movies.csv')
tags = pd.read_csv('C:/Users/DELL/Downloads/ml-latest-small/ml-latest-small/tags.csv')
links = pd.read_csv('C:/Users/DELL/Downloads/ml-latest-small/ml-latest-small/links.csv')

In [4]:
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [5]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [6]:
tags.head()

   userId  movieId              tag   timestamp
0       2    60756            funny  1445714994
1       2    60756  Highly quotable  1445714996
2       2    60756     will ferrell  1445714992
3       2    89774     Boxing story  1445715207
4       2    89774              MMA  1445715200

In [7]:
links.head()

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0
3        4  114885  31357.0
4        5  113041  11862.0

In [3]:
tags.describe(include='all')
ratings.describe(include='all')

              userId        movieId         rating     timestamp
count  100836.000000  100836.000000  100836.000000  1.008360e+05
mean      326.127564   19435.295718       3.501557  1.205946e+09
std       182.618491   35530.987199       1.042529  2.162610e+08
min         1.000000       1.000000       0.500000  8.281246e+08
25%       177.000000    1199.000000       3.000000  1.019124e+09
50%       325.000000    2991.000000       3.500000  1.186087e+09
75%       477.000000    8122.000000       4.000000  1.435994e+09
max       610.000000  193609.000000       5.000000  1.537799e+09

In [9]:
print('----ratings----')
print(ratings.isnull().sum())
print('----tags----')
print(tags.isnull().sum())
print('----movies----')
print(movies.isnull().sum())
print('----links----')
print(links.isnull().sum())

----ratings----
userId       0
movieId      0
rating       0
timestamp    0
dtype: int64
----tags----
userId       0
movieId      0
tag          0
timestamp    0
dtype: int64
----movies----
movieId    0
title      0
genres     0
dtype: int64
----links----
movieId    0
imdbId     0
tmdbId     8
dtype: int64

In [10]:
print('----ratings----')
print(ratings.dtypes)
print('----tags----')
print(tags.dtypes)
print('----movies----')
print(movies.dtypes)
print('----links----')
print(links.dtypes)

----ratings----
userId         int64
movieId        int64
rating       float64
timestamp      int64
dtype: object
----tags----
userId        int64
movieId       int64
tag          object
timestamp     int64
dtype: object
----movies----
movieId     int64
title      object
genres     object
dtype: object
----links----
movieId      int64
imdbId       int64
tmdbId     float64
dtype: object

In [11]:
# Changing the timstamp column from the integer values to actual time
ratings['timestamp'] = pd.to_datetime(ratings['timestamp'],unit = 's')
tags['timestamp'] = pd.to_datetime(tags['timestamp'],unit = 's')

In [12]:
print('----ratings----')
print(ratings.dtypes)
print('----tags----')
print(tags.dtypes)

----ratings----
userId                int64
movieId               int64
rating              float64
timestamp    datetime64[ns]
dtype: object
----tags----
userId                int64
movieId               int64
tag                  object
timestamp    datetime64[ns]
dtype: object

In [13]:
movies.describe(include='all')

              movieId        title genres
count     9742.000000         9742   9742
unique            NaN         9737    951
top               NaN  Emma (1996)  Drama
freq              NaN            2   1053
mean     42200.353623          NaN    NaN
std      52160.494854          NaN    NaN
min          1.000000          NaN    NaN
25%       3248.250000          NaN    NaN
50%       7300.000000          NaN    NaN
75%      76232.000000          NaN    NaN
max     193609.000000          NaN    NaN

In [14]:
#identified the columns which has null values. Handling Null values in the dataset with fillna function

links['tmdbId'].fillna(0, inplace=True)
links['tmdbId'] = links['tmdbId'].astype('int')

#tags['tag'].fillna('No Comment', inplace= True)

C:\Users\DELL\AppData\Local\Temp\ipykernel_4876\3581977088.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  links['tmdbId'].fillna(0, inplace=True)

In [23]:
#merging ratings and movie dataset
movie_rating = pd.merge(ratings,movies,on='movieId')

In [24]:
movies['genres'].nunique()

951

In [25]:
movie_rating.head()

,userId,movieId,rating,timestamp,title,genres
0,1,1,4.0,2000-07-30 18:45:03,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,1,3,4.0,2000-07-30 18:20:47,Grumpier Old Men (1995),Comedy|Romance
2,1,6,4.0,2000-07-30 18:37:04,Heat (1995),Action|Crime|Thriller
3,1,47,5.0,2000-07-30 19:03:35,Seven (a.k.a. Se7en) (1995),Mystery|Thriller
4,1,50,5.0,2000-07-30 18:48:51,"Usual Suspects, The (1995)",Crime|Mystery|Thriller

In [28]:
#Which moview has received the most number of ratings
movie_rating['title'].value_counts(ascending=False).reset_index()

                                 title  count
0                  Forrest Gump (1994)    329
1     Shawshank Redemption, The (1994)    317
2                  Pulp Fiction (1994)    307
3     Silence of the Lambs, The (1991)    279
4                   Matrix, The (1999)    278
...                                ...    ...
9714      Sex, Drugs & Taxation (2013)      1
9715        Extraordinary Tales (2015)      1
9716                   Tomorrow (2015)      1
9717     Embrace of the Serpent (2016)      1
9718                         31 (2016)      1

[9719 rows x 2 columns]

In [41]:
movie_rating_cnt_avg = movie_rating.groupby('title')['rating'].agg(['count','mean'])
movie_rating_cnt_avg.nlargest(10, 'count').reset_index()

                                       title  count      mean
0                        Forrest Gump (1994)    329  4.164134
1           Shawshank Redemption, The (1994)    317  4.429022
2                        Pulp Fiction (1994)    307  4.197068
3           Silence of the Lambs, The (1991)    279  4.161290
4                         Matrix, The (1999)    278  4.192446
5  Star Wars: Episode IV - A New Hope (1977)    251  4.231076
6                       Jurassic Park (1993)    238  3.750000
7                          Braveheart (1995)    237  4.031646
8          Terminator 2: Judgment Day (1991)    224  3.970982
9                    Schindler's List (1993)    220  4.225000

In [49]:
avg_rating_count = movie_rating_cnt_avg['count'].agg('mean')
movie_rating_cnt_avg[movie_rating_cnt_avg['count'] > avg_rating_count].nlargest(10, 'mean').reset_index()

                                           title  count      mean
0                          Secrets & Lies (1996)     11  4.590909
1            Guess Who's Coming to Dinner (1967)     11  4.545455
2                          Paths of Glory (1957)     12  4.541667
3               Streetcar Named Desire, A (1951)     20  4.475000
4               Celebration, The (Festen) (1998)     12  4.458333
5                                     Ran (1985)     15  4.433333
6               Shawshank Redemption, The (1994)    317  4.429022
7                         His Girl Friday (1940)     14  4.392857
8  Sunset Blvd. (a.k.a. Sunset Boulevard) (1950)     27  4.333333
9                            Hustler, The (1961)     18  4.333333

In [ ]:
plt.hist(movie_rating['rating'],bins = 50)
plt.xlabel('Rating')
plt.ylabel('Frequency')
plt.title('Distribution of movie ratings')
plt.show()

In [ ]:
movie_rating_mean = movie_rating.groupby('movieId')['rating'].mean().sort_values(ascending=False)
print(movie_rating_mean)
#movie_rating['rating'] = movie_rating['rating'].astype('float')

In [ ]:
#Genre Analysis
#movies['genres'] = movies['genres'].str.split('|')
#movie_genre = movies.explode('genres')
#del movie_rating['genres']
#genre_rating = pd.merge(movie_genre,movie_rating,on='movieId')
genre_rating_mean = genre_rating.groupby('genres')['rating'].mean().reset_index()

print(genre_rating_mean)

In [ ]:
print(genre_rating.isnull().sum())
#genre_rating.head()

In [ ]:
genre_rating_cnt = genre_rating.groupby('genres')['rating'].count().reset_index()
print(genre_rating_cnt)

In [ ]:
genre_rating_filtered = genre_rating.loc[genre_rating['genres'] == '(no genres listed)']

print(genre_rating_filtered)

In [ ]:
#review_count = movie_rating.groupby('movieId','rating')['userId'].count()
# del ratings
# del movies
del links
del tags
movie_rating.describe(include='all')

In [ ]:
plt.bar(genre_rating.index,genre_rating['rating'],label = 'A')
plt.bar(genre_rating.index,genre_rating['genre'],label = 'B')
plt.xlabel('Index')
plt.ylabel('Value')
plt.show()

In [ ]:
sns.barplot(x='index', y='Value',hue='Category',data=genre_rating)
plt.xlabel('Index')
plt.ylabel('Value')

plt.show()